## DATA manipulation 
### using pandas

#### data types:

In [1]:
import pandas as pd
import numpy as np

In [13]:
df = pd.DataFrame(
    {
        "A": 1.0,
        "B": [pd.Timestamp("20220102"),pd.Timestamp("20220103"),pd.Timestamp("20220202"),pd.Timestamp("20220105")],
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

In [5]:
df

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-03  1.0  3  train  foo
2  1.0 2013-02-02  1.0  3   test  foo
3  1.0 2013-01-05  1.0  3  train  foo

In [3]:
df.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

##### <font color="grey">DataFrame</font>.to_numpy( )
gives a NumPy representation of the underlying data. Note that this can be an expensive operation when your DataFrame has columns with different data types, which comes down to a fundamental difference between pandas and NumPy

##### <font color="grey">DataFrame</font>.sort_index( axis= ? (0 by default), ascending= ? (True by default) )
##### <font color="grey">DataFrame</font>.sort_values( axis= ? (0 by default), ascending= ? (True by default) )

In [10]:
df = df.sort_index(axis=1,ascending=False)

In [11]:
df.sort_index(axis=1,ascending=False)

     F      E  D    C          B    A
0  foo   test  3  1.0 2013-01-02  1.0
1  foo  train  3  1.0 2013-01-03  1.0
2  foo   test  3  1.0 2013-02-02  1.0
3  foo  train  3  1.0 2013-01-05  1.0

In [14]:
df.sort_values(by="B",ascending=False)

     A          B    C  D      E    F
2  1.0 2022-02-02  1.0  3   test  foo
3  1.0 2022-01-05  1.0  3  train  foo
1  1.0 2022-01-03  1.0  3  train  foo
0  1.0 2022-01-02  1.0  3   test  foo

##### <font color="grey">DataFrame</font>.merge(  )

In [23]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})

right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})
df3 = pd.merge(left,right )

In [16]:
left

   key  lval
0  foo     1
1  foo     2

In [17]:
right

   key  rval
0  foo     4
1  foo     5

In [20]:
df2

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [24]:
df3

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5